package com.robotix.a9c_alpha_class;

import android.util.ArrayMap;

class BaseData {
    protected static String[] day_of_week_names = new String[] {"Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресение"};

    protected static String[] students = new String[] {"Арапова Мария", "Ащеулова Анна", "Бекетов Роман", "Ващев Михаил", "Власов Данил", "Григорьева Эвелина",
            "Дадынский Матвей", "Дмитриев Алексей", "Дурнева Екатерина", "Евсеева Виктория", "Коротнева Олеся",
            "Кубакин Егор", "Куркин Егор", "Курлаев Александр", "Лепетанов Артём", "Макрушин Максим", "Медведева Елизавета", "Мурзина Аниса",
            "Онищук Лев", "Сизов Михаил", "Скуковская Варвара", "Смывина Виктория", "Титкова Валерия", "Туманов Захар", "Чернодаров Матвей", "Щербинин Кирилл"};

    protected static String[] subjects = new String[] {"Английский язык", "Астрономия", "Биология", "География", "Информатика", "Испанский язык", "Исскуство", "История",
            "Итальянский язык", "Китайский язык", "Литература", "Математика", "Немецкий язык", "ОБЖ", "Обществознание", "Право", "Русский язык", "Технология", "Физика",
            "Физическая культура", "Французкий язык", "Химия", "Экология", "Экономика", "Алгебра", "Геометрия", "Классный час"};

    protected static Integer[] dezhurstva = new Integer[] {
            2, 10, // Бекетов Коротнева
            1, 13, // Ащеулова Курлаев
            3, 20, // Ващев Скуковская
            11, 22, // Кубакин Титкова
            17, 24, // Мурзина Чернодаров
            8, 12, // Дурнева Куркин
            4, 16, // Власов Медведева
            7, 21, // Дмитриев Смывина
            6, 25, // Дадынский Щербинин
            5, 23, // Григорьева Туманов
            0, 19, // Арапова Сизов
            14, 15, // Лепетанов Макрушин
            9, 18 // Евсеева Онищук
    };

    protected static Object[][][] base_schedule = {
            {
                    {480, 40, subjects[0], 0},
                    {530, 40, subjects[19], 0},
                    {585, 40, subjects[21], 0},
                    {640, 40, subjects[7], 0},
                    {695, 40, subjects[16], 0},
                    {745, 40, subjects[25], 0}
            },
            {
                    {480, 40, subjects[4], 0},
                    {530, 40, subjects[4], 0},
                    {585, 40, subjects[3], 0},
                    {640, 40, subjects[24], 0},
                    {695, 40, subjects[16], 0},
                    {745, 40, subjects[16], 0},
                    {795, 40, subjects[26], 0}
            },
            {
                    {480, 40, subjects[7], 0},
                    {530, 40, subjects[2], 0},
                    {585, 40, subjects[18], 0},
                    {640, 40, subjects[18], 0},
                    {695, 40, subjects[24], 0},
                    {745, 40, subjects[24], 0}
            },
            {
                    {480, 40, subjects[10], 0},
                    {530, 40, subjects[10], 0},
                    {585, 40, subjects[14], 0},
                    {640, 40, subjects[21], 0},
                    {695, 40, subjects[3], 0},
                    {745, 40, subjects[25], 0},
                    {795, 40, subjects[25], 0}
            },
            {
                    {480, 40, subjects[0], 0},
                    {530, 40, subjects[0], 0},
                    {585, 40, subjects[13], 0},
                    {640, 40, subjects[7], 0},
                    {695, 40, subjects[16], 0}
            },
            {
                    {530, 40, subjects[19], 0},
                    {585, 40, subjects[2], 0},
                    {640, 40, subjects[18], 0},
                    {695, 40, subjects[24], 0},
                    {745, 40, subjects[24], 0},
                    {795, 40, subjects[12], 0}
            },
            {}
    }; // {time_start (min), duration (min), title, prioritet}

    protected static ArrayMap<String, Integer[]> olympDates() {
        ArrayMap<String, Integer[]> dates = new ArrayMap<>();
        dates.put("2022-09-22", new Integer[]{10});
        dates.put("2022-09-23", new Integer[]{14});
        dates.put("2022-09-27", new Integer[]{6, 23});
        dates.put("2022-09-28", new Integer[]{0});
        dates.put("2022-09-29", new Integer[]{15, 19});
        dates.put("2022-09-30", new Integer[]{3, 18});
        dates.put("2022-10-04", new Integer[]{12, 20});
        dates.put("2022-10-06", new Integer[]{16});
        dates.put("2022-10-07", new Integer[]{21});
        dates.put("2022-10-11", new Integer[]{22, 1});
        dates.put("2022-10-12", new Integer[]{13, 7});
        dates.put("2022-10-13", new Integer[]{17});
        dates.put("2022-10-14", new Integer[]{2});
        dates.put("2022-10-18", new Integer[]{8, 9, 5});
        dates.put("2022-10-21", new Integer[]{11});
        dates.put("2022-10-28", new Integer[]{4});
        return dates;
    };

    protected static Integer[][] studentsOnOlymp = {
            {6, 8, 15, 17}, // "Английский язык"
            {14, 19}, // "Астрономия"
            {5, 10, 13, 14, 25}, // "Биология"
            {14}, // "География"
            {1, 3, 6, 7, 11, 12, 13, 14, 15, 18, 19, 23, 24}, // "Информатика"
            {}, // "Испанский язык"
            {}, // "Исскуство"
            {2, 12, 13}, // "История"
            {}, // "Итальянский язык"
            {}, // "Китайский язык"
            {1, 16, 17, 21}, // "Литература"
            {-1}, // "Математика"
            {}, // "Немецкий язык"
            {2, 7, 11, 14, 16, 21, 22, 23, 25}, // "ОБЖ"
            {2, 5, 8, 9, 16, 21, 22}, // "Обществознание"
            {}, // "Право"
            {1, 3, 8, 9, 10, 12, 13, 15, 17, 22, 23, 25}, // "Русский язык"
            {11, 12, 14}, // "Технология"
            {-1}, // "Физика"
            {14, 18}, // "Физическая культура"
            {}, // "Французкий язык"
            {10, 19}, // "Химия"
            {2, 8, 9, 10, 12, 14, 16, 21}, // "Экология"
            {0, 2, 5, 9}, // "Экономика"
            {}, // "Алгебра"
            {}, // "Геометрия"
            {} //  "Классный час"
    };


    protected static Object[][][] OGEs = {
            {
                    {895, 40, "16a", 10},
                    {950, 40, "16b", 10}
            },
            {
                    {840, 40, "14a", 10},
                    {840, 40, "4a", 10},
                    {895, 40, "21a", 10},
                    {950, 40, "4b", 10}
            },
            {
                    {795, 40, "11a", 10},
                    {840, 40, "18a", 10}
            },
            {
                    {840, 40, "18b", 10}
            },
            {
                    {840, 40, "18b", 10}
            },
            {
                    {795, 40, "2a", 10}
            },
            {}
    };

    protected static ArrayMap<String, Integer[]> OGE_students() {
        ArrayMap<String, Integer[]> OGE_students = new ArrayMap<>();
        OGE_students.put("2a", new Integer[]{10, 25});
        OGE_students.put("4a", new Integer[]{3, 4, 6, 7, 11, 12, 13, 19, 23, 24});
        OGE_students.put("4b", new Integer[]{1, 2, 14, 15, 17, 18});
        OGE_students.put("11a", new Integer[]{-1});
        OGE_students.put("14a", new Integer[]{0, 2, 5, 8, 9, 20, 21, 22});
        OGE_students.put("16a", new Integer[]{-1});
        OGE_students.put("16b", new Integer[]{8, 9, 10, 13, 14, 15, 20, 21});
        OGE_students.put("18a", new Integer[]{3, 5, 9, 11, 12, 13, 15, 20, 23, 25});
        OGE_students.put("18b", new Integer[]{0, 1, 4, 6, 7, 14, 16, 17, 18, 19, 21, 22, 24});
        OGE_students.put("0a", new Integer[]{8, 16});
        OGE_students.put("21a", new Integer[]{10});
        return OGE_students;
    }

    protected static String version_history = "<b>1.6.1.1 release:</b><br>- исправлены баги с фишками из предыдущей версии<br>- восстановлена случайно снесённая функция автообновления<br>" +
            "<b>1.6.1 release:</b><br>- исправлена проблема с отображением вкладки событий<br>- добавлена возможность смотреть расписания на следующие недели<br>- онлайн-события теперь персонализированы<br>- онлайн-события теперь могут создавать оповещения<br>" +
            "<b>1.6 release:</b><br>- добавлено персональное расписание<br>- появилась возможность добавления событий онлайн<br>" +
            "<b>1.5.1.3 release:</b><br>- система уведомлений работает<br>- приложение больше не должно вылетать<br>" +
            "<b>1.5.1.2 release:</b><br>- переписана логика уведомлений и механизм оповещения<br>- исправлена ошибка вылета приложения<br>" +
            "<b>1.5.1.1 release:</b><br>- уведомления работают при выключенном приложении (теперь точно)<br>" +
            "<b>1.5.1 release:</b><br>- добавлен функционал уведомлений<br>- уведомления работают при выключенном приложении<br>" +
            "<b>1.5 release:</b><br>- добавлена система уведомлений<br>- исправлено огромное количество уведомлений о скачивании<br>- версия сырая, но вроде работает<br>" +
            "<b>1.4.1 release:</b><br>- исправлены вылеты<br>- автообновление полностью функционирует при всех разрешениях<br>" +
            "<b>1.4 release:</b><br>- исправлены незначительные ошибки из предыдущего обновления<br>- добавлено автообновление (на данный момент не работает запуск)<br>" +
            "<b>1.3.2 release:</b><br>- исправлена критическая ошибка, не позволявшая запустить приложение<br>- добавлена информация об олимпиадах и консультациях на следующий день<br>- исправлены неверные данные (те, о которых было сообщено)<br><br>" +
            "<b>1.3.1 release:</b><br>- минимальная версия Android снижена до 8.0<br>- доработана ночная тема<br>- добавлены данные о консультациях, они появляются в соответствующие дни недели<br>- добавлен выбор пользователя (это понадобится в последующих версиях)<br><br>" +
            "<b>1.3 release:</b><br>- данные обновлены для 9 класса<br>- код переписан на Java<br>- изменено цветовое оформление<br>- пока что не всё из предыдущей версии перенесено<br><br>" +
            "<b>1.2 release:</b><br>- изменено цветовое оформление<br>- добавлена смена темы ночью<br>- оптимизировано использование оперативной памяти<br>- добавлен список, который вы читаете";
}
